#+title: Someday
#+STARTUP: show2levels

* A
** TODO [#B] magit [0/3]
*** TODO [#B] Learn Git Branching
:LOGBOOK:
CLOCK: [2025-01-11 六 00:17]--[2025-01-11 六 00:57] =>  0:40
CLOCK: [2025-01-10 五 16:40]--[2025-01-10 五 17:04] =>  0:24
CLOCK: [2025-01-10 五 15:38]--[2025-01-10 五 16:00] =>  0:22
:END:
*** TODO [#B] git变基
*** TODO [#B] magit
** TODO [#B] lsp问题 [2/4]
*** DONE cpp-mode缩进问题
- Note taken on [2025-02-02 日 17:05] \\
  解决：https://emacs-china.org/t/emacs/19319/7
*** DONE 打开cpp文件，是c-mode
*** TODO lsp-ui-doc关闭
*** TODO minibuffer提示关闭
* B
** TODO [#B] arch官方文档 [0/0]
** TODO [#B] 阅读embark文档
* C
** TODO [#C] 还原org中的斜体，自己写一个新的强调符号
** TODO [#C] org-download图片存放改用directory
+ 线索：org-download org-attach
** TODO [#B] org中输入公式
** TODO [#B] 重复任务中的重复行为笔记记录
[[file:~/.org/roam/20241223152839-org.org::*几种重复行为][几种重复行为]]
** TODO [#B] zero width space在表格中无法转义|
** TODO [#B] org-agenda日程到了没有提醒
- org-alert
** TODO [#B] agenda buffer显示父任务及子目录
** TODO [#B] 自制emacs插件：ai找笔记 [0/0]
** TODO [#C] 表格设置倒计时的函数 [0/0]
** TODO [#B] 为musicfox写一个插件 [0/0]
** TODO [#B] ai自动查文档 [0/0]
